#+TITLE: Org Mode for AoC Development
#+AUTHOR: AoC Ruby Tutorials
#+PROPERTY: header-args :results output :exports both
#+PROPERTY: header-args:ruby :session ruby-tutorial
#+PROPERTY: header-args:elisp :lexical t
#+STARTUP: overview

** Basic Syntax

#+BEGIN_EXAMPLE
,#+BEGIN_SRC ruby
puts "Hello, AoC!"
,#+END_SRC
#+END_EXAMPLE

Execute with =C-c C-c=:

#+BEGIN_SRC ruby
puts "Hello from Ruby #{RUBY_VERSION}!"
#+END_SRC

#+RESULTS:
: Hello from Ruby 3.3.8!

*** Output (stdout)

#+BEGIN_SRC ruby :results output
3.times { |i| puts "Line #{i}" }
#+END_SRC

#+RESULTS:
: Line 0
: Line 1
: Line 2

*** Value (return value)

#+BEGIN_SRC ruby :results value
(1..10).sum
#+END_SRC

#+RESULTS:
: 55

*** Table output

#+BEGIN_SRC ruby :results value table
[['Name', 'Value'], ['Ruby', RUBY_VERSION], ['Platform', RUBY_PLATFORM]]
#+END_SRC

#+RESULTS:
| Name     | Value           |
| Ruby     | 3.3.8           |
| Platform | amd64-freebsd14 |

** Sessions

Sessions maintain state between blocks:

#+BEGIN_SRC ruby :session aoc
@counter = 0
def increment
  @counter += 1
end
"Session initialized"
#+END_SRC

#+RESULTS:
: Session initialized

#+BEGIN_SRC ruby :session aoc
increment
increment
"Counter is now #{@counter}"
#+END_SRC

#+RESULTS:
: Counter is now 2

** Inline Elisp

#+BEGIN_SRC elisp
(format "Emacs version: %s" emacs-version)
#+END_SRC

#+RESULTS:
: Emacs version: 29.4

** Elisp Variables in Ruby

#+BEGIN_SRC elisp :var x=42
(format "x = %d, doubled = %d" x (* x 2))
#+END_SRC

#+RESULTS:
: x = 42, doubled = 84

